<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [1]:
# !pip install sqlalchemy==1.3.9
import sqlalchemy

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [2]:
# !pip install ipython-sql
# !pip install ipython-sql prettytable

In [3]:
%load_ext sql

In [4]:
import csv, sqlite3
# import prettytable
# prettytable.DEFAULT = 'DEFAULT'

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [5]:
!pip install -q pandas

In [6]:
%sql sqlite:///my_data1.db

MetaData.__init__() got an unexpected keyword argument 'bind'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [7]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

101

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date               101 non-null    object
 1   Time (UTC)         101 non-null    object
 2   Booster_Version    101 non-null    object
 3   Launch_Site        101 non-null    object
 4   Payload            101 non-null    object
 5   PAYLOAD_MASS__KG_  101 non-null    int64
 6   Orbit              101 non-null    object
 7   Customer           101 non-null    object
 8   Mission_Outcome    101 non-null    object
 9   Landing_Outcome    101 non-null    object
dtypes: int64(1), object(9)
memory usage: 8.0+ KB

In [36]:
df.head()

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing_Outcome
0,2010-06-04,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,2010-12-08,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,2012-05-22,7:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,2012-10-08,0:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,2013-03-01,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt

In [38]:
df['Landing_Outcome'].value_counts()

Landing_Outcome
Success                   38
No attempt                21
Success (drone ship)      14
Success (ground pad)       9
Controlled (ocean)         5
Failure (drone ship)       5
Failure                    3
Failure (parachute)        2
Uncontrolled (ocean)       2
Precluded (drone ship)     1
No attempt                 1
Name: count, dtype: int64

**Note:This below code is added to remove blank rows from table**

In [9]:
#DROP THE TABLE IF EXISTS

%sql DROP TABLE IF EXISTS SPACEXTABLE;

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [10]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [11]:
import pandas as pd

# Query sqlite_master to get the list of tables
tables_df = pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", 
                        con)

# Display the DataFrame or convert to a list
print(tables_df)
print(tables_df['name'].tolist())  # List of table names

          name
0  SPACEXTABLE
1    SPACEXTBL
['SPACEXTABLE', 'SPACEXTBL']

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [12]:
df['Launch_Site'].unique()

array(['CCAFS LC-40', 'VAFB SLC-4E', 'KSC LC-39A', 'CCAFS SLC-40'],
      dtype=object)

In [13]:
df['Launch_Site'].value_counts()

Launch_Site
CCAFS SLC-40    34
CCAFS LC-40     26
KSC LC-39A      25
VAFB SLC-4E     16
Name: count, dtype: int64

In [14]:
pd.read_sql("SELECT DISTINCT Launch_Site FROM SPACEXTABLE", con)

    Launch_Site
0   CCAFS LC-40
1   VAFB SLC-4E
2    KSC LC-39A
3  CCAFS SLC-40


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [15]:
query_2 = \
"SELECT Launch_Site FROM SPACEXTABLE WHERE Launch_Site LIKE 'CCA%' LIMIT 5"

result_2 = pd.read_sql(query_2, con)

print(result_2)

   Launch_Site
0  CCAFS LC-40
1  CCAFS LC-40
2  CCAFS LC-40
3  CCAFS LC-40
4  CCAFS LC-40

In [16]:
query_2B = \
"SELECT DISTINCT Launch_Site FROM SPACEXTABLE WHERE Launch_Site LIKE 'CCA%'"

result_2b = pd.read_sql(query_2B, con)

print(result_2b)

    Launch_Site
0   CCAFS LC-40
1  CCAFS SLC-40

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [17]:
query_colnames = "SELECT * FROM SPACEXTABLE LIMIT 1"
result_colnames = pd.read_sql(query_colnames, con)

print(result_colnames)

         Date Time (UTC) Booster_Version  Launch_Site  \
0  2010-06-04   18:45:00  F9 v1.0  B0003  CCAFS LC-40

                                Payload  PAYLOAD_MASS__KG_ Orbit Customer  \
0  Dragon Spacecraft Qualification Unit                  0   LEO   SpaceX

  Mission_Outcome      Landing_Outcome
0         Success  Failure (parachute)

In [18]:
query_DISTINCT_Booster_Version = "SELECT DISTINCT Booster_Version FROM SPACEXTABLE"
result_DISTINCT_Booster_Version = pd.read_sql(query_DISTINCT_Booster_Version, con)

print(result_DISTINCT_Booster_Version )

   Booster_Version
0   F9 v1.0  B0003
1   F9 v1.0  B0004
2   F9 v1.0  B0005
3   F9 v1.0  B0006
4   F9 v1.0  B0007
..             ...
92    F9 B5B1062.1
93   F9 B5B1061.1
94    F9 B5B1063.1
95  F9 B5 B1049.7
96  F9 B5 B1058.4

[97 rows x 1 columns]

In [19]:
df['Customer'].value_counts()

Customer
NASA (CRS)                                                   20
SpaceX                                                       13
Iridium Communications                                        7
SES                                                           5
AsiaSat                                                       2
SpaceX, Planet Labs                                           2
SKY Perfect JSAT Group                                        2
ABS Eutelsat                                                  2
Telesat                                                       2
Thaicom                                                       2
Orbcomm                                                       2
CONAE, PlanetIQ, SpaceX                                       1
NASA (CRS), Kacific 1                                         1
CONAE                                                         1
Es hailSat                                                    1
Spaceflight Industries                                        1
USAF                                                          1
PSN, SpaceIL / IAI                                            1
NASA (CCD)                                                    1
Canadian Space Agency (CSA)                                   1
Spacecom                                                      1
Sky Perfect JSAT, Kacific 1                                   1
NASA (CTS)                                                    1
NASA (CCDev)                                                  1
NASA (CCP)                                                    1
U.S. Space Force                                              1
Telkom Indonesia                                              1
USSF                                                          1
SpaceX, Spaceflight Industries (BlackSky), Planet Labs        1
SpaceX, Planet Labs, PlanetIQ                                 1
Republic of Korea Army, Spaceflight Industries (BlackSky)     1
Hispasat  NovaWurks                                           1
Iridium Communications GFZ ‚ NASA                             1
Bulsatcom                                                     1
NASA (COTS)                                                   1
MDA                                                           1
U.S. Air Force NASA NOAA                                      1
Turkmenistan National Space Agency                            1
NASA (LSP) NOAA CNES                                          1
EchoStar                                                      1
NRO                                                           1
Inmarsat                                                      1
Intelsat                                                      1
Thales-Alenia/BTRC                                            1
NSPO                                                          1
U.S. Air Force                                                1
SES EchoStar                                                  1
KT Corporation                                                1
Northrop Grumman                                              1
Hisdesat exactEarth SpaceX                                    1
NASA (COTS) NRO                                               1
NASA (LSP)                                                    1
NASA / NOAA / ESA / EUMETSAT                                  1
Name: count, dtype: int64

In [20]:
df.head(2)

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing_Outcome
0,2010-06-04,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,2010-12-08,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)

In [21]:
query_3 = \
"SELECT SUM(PAYLOAD_MASS__KG_) AS TotalPayloadMass_Nasa FROM SPACEXTABLE WHERE Customer LIKE '%NASA (CRS)%' "
result_3 = pd.read_sql(query_3, con)

print(result_3)

   TotalPayloadMass_Nasa
0                  48213

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [22]:
query_4 = "SELECT AVG(PAYLOAD_MASS__KG_) FROM SPACEXTABLE WHERE Booster_Version LIKE 'F9 v1.1'"
result_4 = pd.read_sql(query_4, con)
print(result_4)

   AVG(PAYLOAD_MASS__KG_)
0                  2928.4

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [23]:
# df.info()
# df.head()
df['Landing_Outcome'].value_counts()

Landing_Outcome
Success                   38
No attempt                21
Success (drone ship)      14
Success (ground pad)       9
Controlled (ocean)         5
Failure (drone ship)       5
Failure                    3
Failure (parachute)        2
Uncontrolled (ocean)       2
Precluded (drone ship)     1
No attempt                 1
Name: count, dtype: int64

In [24]:
query_5 = """SELECT MIN(Date) FROM SPACEXTABLE 
WHERE Landing_Outcome LIKE 'Success (ground pad)'"""
result_5 = pd.read_sql(query_5, con)
print(result_5)

    MIN(Date)
0  2015-12-22

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [25]:
query_6 = """
SELECT Booster_Version FROM SPACEXTABLE 
WHERE Landing_Outcome LIKE 'Success (drone ship)' 
AND PAYLOAD_MASS__KG_ BETWEEN 4000 AND 6000"""
result_6 = pd.read_sql(query_6, con)
print(result_6)

  Booster_Version
0     F9 FT B1022
1     F9 FT B1026
2  F9 FT  B1021.2
3  F9 FT  B1031.2

### Task 7




##### List the total number of successful and failure mission outcomes

In [26]:
query_7a = """
SELECT DISTINCT Mission_Outcome FROM SPACEXTABLE """
result_7a = pd.read_sql(query_7a, con)
print(result_7a)

                    Mission_Outcome
0                           Success
1               Failure (in flight)
2  Success (payload status unclear)
3                          Success

In [27]:
query_7a = """
SELECT
CASE
WHEN Mission_Outcome LIKE '%Success%' THEN  "Successes"
WHEN Mission_Outcome LIKE '%Failure%' THEN "Failures"
ELSE "Error"
END,
COUNT(*) AS total_count

FROM SPACEXTABLE 
"""
result_7a = pd.read_sql(query_7a, con)
print(result_7a)

  CASE\nWHEN Mission_Outcome LIKE '%Success%' THEN  "Successes"\nWHEN Mission_Outcome LIKE '%Failure%' THEN "Failures"\nELSE "Error"\nEND  \
0                                          Successes

   total_count
0          101

In [28]:
query_7a = """
SELECT 
    CASE
        WHEN Mission_Outcome LIKE '%Success%' THEN 'Success'
        WHEN Mission_Outcome LIKE '%Failure%' THEN 'Failure'
        ELSE 'Error'
    END AS success_or_failure,
    COUNT(*) AS Total_Count
FROM SPACEXTABLE
GROUP BY success_or_failure;
"""
result_7a = pd.read_sql(query_7a, con)
print(result_7a)

  success_or_failure  Total_Count
0            Failure            1
1            Success          100

### Task 8



##### List all the booster_versions that have carried the maximum payload mass. Use a subquery.

In [29]:
query_8 = """
SELECT 
Booster_Version
FROM SPACEXTABLE
WHERE PAYLOAD_MASS__KG_ =
(SELECT MAX(PAYLOAD_MASS__KG_ )
FROM SPACEXTABLE)
;
"""
result_8 = pd.read_sql(query_8, con)
print(result_8)

   Booster_Version
0    F9 B5 B1048.4
1    F9 B5 B1049.4
2    F9 B5 B1051.3
3    F9 B5 B1056.4
4    F9 B5 B1048.5
5    F9 B5 B1051.4
6    F9 B5 B1049.5
7   F9 B5 B1060.2
8   F9 B5 B1058.3
9    F9 B5 B1051.6
10   F9 B5 B1060.3
11  F9 B5 B1049.7

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

In [30]:
df['Mission_Outcome'].value_counts()

Mission_Outcome
Success                             98
Failure (in flight)                  1
Success (payload status unclear)     1
Success                              1
Name: count, dtype: int64

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date               101 non-null    object
 1   Time (UTC)         101 non-null    object
 2   Booster_Version    101 non-null    object
 3   Launch_Site        101 non-null    object
 4   Payload            101 non-null    object
 5   PAYLOAD_MASS__KG_  101 non-null    int64
 6   Orbit              101 non-null    object
 7   Customer           101 non-null    object
 8   Mission_Outcome    101 non-null    object
 9   Landing_Outcome    101 non-null    object
dtypes: int64(1), object(9)
memory usage: 8.0+ KB

In [32]:
df['Landing_Outcome'].value_counts()

Landing_Outcome
Success                   38
No attempt                21
Success (drone ship)      14
Success (ground pad)       9
Controlled (ocean)         5
Failure (drone ship)       5
Failure                    3
Failure (parachute)        2
Uncontrolled (ocean)       2
Precluded (drone ship)     1
No attempt                 1
Name: count, dtype: int64

In [33]:
query_9 = """
SELECT Booster_Version,  substr(Date, 6,2) as month, 
substr(Date, 1, 4) as year, Launch_Site
FROM SPACEXTABLE
WHERE Landing_Outcome LIKE 'Failure (drone ship)'
AND
substr(Date, 1, 4) = '2015'
;
"""
result_9 = pd.read_sql(query_9, con)
print(result_9)

  Booster_Version month  year  Launch_Site
0   F9 v1.1 B1012    01  2015  CCAFS LC-40
1   F9 v1.1 B1015    04  2015  CCAFS LC-40

In [34]:
query_9b = """
SELECT 
    Booster_Version,
    CASE substr(Date, 6, 2)
        WHEN '01' THEN 'January'
        WHEN '02' THEN 'February'
        WHEN '03' THEN 'March'
        WHEN '04' THEN 'April'
        WHEN '05' THEN 'May'
        WHEN '06' THEN 'June'
        WHEN '07' THEN 'July'
        WHEN '08' THEN 'August'
        WHEN '09' THEN 'September'
        WHEN '10' THEN 'October'
        WHEN '11' THEN 'November'
        WHEN '12' THEN 'December'
    END AS month_name,
    Launch_Site
FROM SPACEXTABLE
WHERE 
    Landing_Outcome LIKE 'Failure (drone ship)'
    AND substr(Date, 1, 4) = '2015'
;

"""
result_9b = pd.read_sql(query_9b, con)
print(result_9b)

  Booster_Version month_name  Launch_Site
0   F9 v1.1 B1012    January  CCAFS LC-40
1   F9 v1.1 B1015      April  CCAFS LC-40

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [35]:
query_9 = """
SELECT 

CASE 
WHEN Landing_Outcome LIKE "%Success%" THEN "success"
WHEN Landing_Outcome LIKE "%Failure%" THEN "failure"
ELSE 
"Other"
END AS result,
COUNT(Landing_Outcome) Total_Outcome

FROM SPACEXTABLE
WHERE Date BETWEEN "2010-06-04" AND "2017-03-20"
GROUP BY result
ORDER BY Total_Outcome DESC

;
"""
result_9 = pd.read_sql(query_9, con)
print(result_9)

    result  Total_Outcome
0    Other             16
1  success              8
2  failure              7

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

<!--
## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2024-07-10 | 1.1 |Anita Verma | Changed Version|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |
-->

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>